<?php

$students = [
  'ИТ20' => [
     'Иванов Иван' => 5,
     'Кириллов Кирилл' => 3,
     'Смирнова Христина Потаповна' => 4,
     'Рогозин Даниил Арсениевич' => 4,
     'Золин Владилен Леонтиевич' => 2,
     'Архаткина Владислава Никитевна' => 3,
     'Мещерякова Мария Елизаровна' => 4,
     'Саврасова Фаина Ивановна' => 2,
     'Хромченко Зинаида Николаевна' => 5,
     'Протасова Майя Леонидовна' => 3
  ],
  'БАП20' => [
     'Антонов Антон' => 4,
     'Ябров Тимур Чеславович' => 2,
     'Белорусов Ефрем Изяславович' => 3,
     'Ягода Назар Прохорович' => 5,
     'Ярилова Розалия Серафимовна' => 4,
     'Нырко Платон Вадимович' => 4,
     'Калинин Агап Моисеевич' => 5,
     'Никифоров Юлиан Прокофиевич' => 3

  ]
];

$middleMark = [];
$dismiss = [];
foreach ($students as $group => $groupList) {
  $middleMark[$group] = array_sum($groupList) / count($groupList);

  foreach($groupList as $studentName => $mark) {
     if($mark < 3) {
      $dismiss[$group][] = $studentName;
     }         

  }
}

$topGroup = array_keys($middleMark, max($middleMark))[0];

// print_r($middleMark);
echo "Наивысший балл у группы: $topGroup = $middleMark[$topGroup]\n";
echo "Список студентов на отчисление за неуспеваемость:\n";
print_r($dismiss);
